            // 1)Напишите программу, где пользователь вводит любое целое положительное число.
            //  А программа суммирует все числа от 1 до введенного пользователем числа.

// let userInput = parseInt(prompt("Введите число:"));
// let sum = 0;
// for (let i = 1; i <= userInput; i++) {
// sum += i;
// }

// console.log(`Сумма чисел от 1 до ${userInput} равна ${sum}.`);

            // 2)Напишите цикл, который за 7 вызовов console.log выводит такой треугольник:

// let str = ''
// for (let i = 1; i <= 7; i++){
//     str = str+'#'
//     console.log(str)
// }


