            // 1)Напишите программу, где пользователь вводит любое целое положительное число.
            //  А программа суммирует все числа от 1 до введенного пользователем числа.

// let userInput = parseInt(prompt("Введите число:"));
// let sum = 0;
// for (let i = 1; i <= userInput; i++) {
// sum += i;
// }

// console.log(`Сумма чисел от 1 до ${userInput} равна ${sum}.`);

            // 2)Напишите цикл, который за 7 вызовов console.log выводит такой треугольник:

// let str = ''
// for (let i = 1; i <= 7; i++){
//     str = str+'#'
//     console.log(str)
// }


            // 3.Напишите программу, которая выводит через console.log все числа от 1 до 100, 
            // с двумя исключениями. Для чисел, нацело делящихся на 3, она должна выводить ‘Fizz’,
            //  а для чисел, делящихся на 5 (но не на 3) – ‘Buzz’

// for (let i = 1; i <= 100; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//     console.log('FizzBuzz');
//     } else if (i % 3 === 0) {
//     console.log('Fizz');
//     } else if (i % 5 === 0) {
//     console.log('Buzz');
//     } else {
//     console.log(i);
//     }
//     }
